//  1) установить кастомную библиотеку JQuery UI
//  2) на основе страницы index.html, которая идет с пакетом библиотеки,
//  реализовать переключение тем оформления страницы, создав боковое меню
//  с иконками основного света темы в качестве подсказки, при нажатии на которую,
//  цветовая схема сайта должна измениться
//
// подсказка: качаем несколько тем и меняем стилевому файлу каждой из них название, соответствующее цвету
// используя append и remove - добавляем или удаляем в head линки на эти стилевые файлы
// для поиска по хеду необходимых для изменения линков, можете использовать поиск по части href
// но я советую использовать data аттрибуты, как мы уже знаем, их можно применять к любому тегу