// Домашнее задание
// написать скрипт, который позволяет пользователю ввести ряд букв и цифр, через запятую
// и в результате работы вывести массив с отсортированными цифрами по возрастанию, 
// убрав при этом буквы из ячеек, и включив их в сортировку
// в конечном результате в массиве должны присутствовать цолько цифры (имеется в виду тип данных)


// я создам вам файл home_task.js в котором буду выкладывать задания, не производите в нем решений,
// не бойтесь создавать новый файл, с кратким названием задания, и в нем решать
// так не будет путаницы


// шпаргалка по массивам, ознакомьтесь с этими методами работы с массивом

//    push/pop, shift/unshift, splice — для добавления и удаления элементов.
//    join/split — для преобразования строки в массив и обратно.
//    sort — для сортировки массива. Если не передать функцию сравнения — сортирует элементы как строки.
//    reverse — меняет порядок элементов на обратный.
//    concat — объединяет массивы.
//    indexOf/lastIndexOf — возвращают позицию элемента в массиве (не поддерживается в IE8-).

// и с этими методами перебора массивов

//    forEach — для перебора массива.
//    filter — для фильтрации массива.
//    every/some — для проверки массива.
//    map — для трансформации массива в массив.
//    reduce/reduceRight — для прохода по массиву с вычислением значения.

// если с каким то из методов не разобрлись, пишите сюда, до вечера вторника
// рассмотрим и разберемся на занятии с ними подробнее в среду