// Домашнее задание
// написать скрипт, который позволяет пользователю ввести ряд букв и цифр, через запятую
// и в результате работы вывести массив с отсортированными цифрами по возрастанию,
// убрав при этом буквы из ячеек, и включив их в сортировку
// в конечном результате в массиве должны присутствовать цолько цифры (имеется в виду тип данных)


// я создам вам файл home_task.js в котором буду выкладывать задания, не производите в нем решений,
// не бойтесь создавать новый файл, с кратким названием задания, и в нем решать
// так не будет путаницы
